In [47]:
import this

In [48]:
import pandas as pd
people = pd.DataFrame({
        '年齢' : [21, 34, 23, 44, 19],
        '身長' : [180, 168, 174, 181, 169],
        '体重' : [74, 61, 65, 82, 70]
        },
        index = ['田中', '北野', '高橋', '岡田', '長谷川'])
people

     年齢   身長  体重
田中   21  180  74
北野   34  168  61
高橋   23  174  65
岡田   44  181  82
長谷川  19  169  70

In [49]:
people.loc['北野']

年齢     34
身長    168
体重     61
Name: 北野, dtype: int64

In [50]:
people.iloc[1]

年齢     34
身長    168
体重     61
Name: 北野, dtype: int64

In [51]:
people.loc['高橋':'長谷川']

     年齢   身長  体重
高橋   23  174  65
岡田   44  181  82
長谷川  19  169  70

In [52]:
people.iloc[2:5]

     年齢   身長  体重
高橋   23  174  65
岡田   44  181  82
長谷川  19  169  70

In [53]:
people.loc[:'高橋']

    年齢   身長  体重
田中  21  180  74
北野  34  168  61
高橋  23  174  65

In [54]:
people.iloc[:3]

    年齢   身長  体重
田中  21  180  74
北野  34  168  61
高橋  23  174  65

In [55]:
people.loc['高橋', ['年齢', '体重']]

年齢    23
体重    65
Name: 高橋, dtype: int64

In [56]:
people.iloc[2, [0, 2]]

年齢    23
体重    65
Name: 高橋, dtype: int64

In [57]:
people.index

Index(['田中', '北野', '高橋', '岡田', '長谷川'], dtype='object')

In [58]:
people['年齢']

田中     21
北野     34
高橋     23
岡田     44
長谷川    19
Name: 年齢, dtype: int64

In [59]:
people.年齢

田中     21
北野     34
高橋     23
岡田     44
長谷川    19
Name: 年齢, dtype: int64

In [60]:
people['顧客ID'] = [100, 101, 102, 103, 104]
people

     年齢   身長  体重  顧客ID
田中   21  180  74   100
北野   34  168  61   101
高橋   23  174  65   102
岡田   44  181  82   103
長谷川  19  169  70   104

In [61]:
people.loc['川口'] = [18, 160, 49, 105]
people

     年齢   身長  体重  顧客ID
田中   21  180  74   100
北野   34  168  61   101
高橋   23  174  65   102
岡田   44  181  82   103
長谷川  19  169  70   104
川口   18  160  49   105

In [34]:
people2 = pd.DataFrame({
        '名前' : ['北野', '田中'],
        '年齢' : [22, 28]
        })

In [35]:
people2.年齢

0    22
1    28
Name: 年齢, dtype: int64

In [36]:
people2['年齢']

0    22
1    28
Name: 年齢, dtype: int64